---
title: OBJExportOptions
classe: Autodesk.Revit.DB.OBJExportOptions
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.BIMExportOptions
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# OBJExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double GridAspectRatio { get; set; }` | `oBJExportOptions.GridAspectRatio` | Double |
| `Double MaxEdgeLength { get; set; }` | `oBJExportOptions.MaxEdgeLength` | Double |
| `Double NormalTolerance { get; set; }` | `oBJExportOptions.NormalTolerance` | Double |
| `Double SurfaceTolerance { get; set; }` | `oBJExportOptions.SurfaceTolerance` | Double |
| `ExportUnit TargetUnit { get; set; }` | `oBJExportOptions.TargetUnit` | ExportUnit |
| `Boolean IsGridAspectRatioSet()` | `oBJExportOptions.IsGridAspectRatioSet()` | Boolean |
| `Boolean IsMaxEdgeLengthSet()` | `oBJExportOptions.IsMaxEdgeLengthSet()` | Boolean |
| `Boolean IsNormalToleranceSet()` | `oBJExportOptions.IsNormalToleranceSet()` | Boolean |
| `Boolean IsSurfaceToleranceSet()` | `oBJExportOptions.IsSurfaceToleranceSet()` | Boolean |
| `Boolean IsValidForGridAspectRatio(Double)` | `OBJExportOptions.IsValidForGridAspectRatio(value)` | Boolean |
| `Boolean IsValidForMaxEdgeLength(Double)` | `OBJExportOptions.IsValidForMaxEdgeLength(value)` | Boolean |
| `Boolean IsValidForNormalTolerance(Double)` | `OBJExportOptions.IsValidForNormalTolerance(value)` | Boolean |
| `Boolean IsValidForSurfaceTolerance(Double)` | `OBJExportOptions.IsValidForSurfaceTolerance(value)` | Boolean |
| `Void SetTessellationSettings(ExportResolution)` | `oBJExportOptions.SetTessellationSettings(resolutionType)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```